Revit 2027 API
AppearanceAssetEditScope Methods
The AppearanceAssetEditScope type exposes the following members.
Methods
Name | Description
Cancel |  Cancels the edit scope.
Commit |  Finishes the edit scope.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Start |  Starts the edit scope.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace